Repository: pernebye/Ketroy
Catalog: ketroy-flutter-dev/lib/l10n/app_*.arb
Languages: kk, ru

# fieldClothingSize
source: Clothing Size
kk: Киім өлшемі
ru: Размер одежды

# fieldShoeSize
source: Shoe Size
kk: Аяқ киім өлшемі
ru: Размер обуви

# selectDatePlaceholder
source: Select date
kk: Күнді таңдаңыз
ru: Выберите дату

# selectCityPlaceholder
source: Select city
kk: Қаланы таңдаңыз
ru: Выберите город

# saveButton
source: Save Changes
kk: Өзгерістерді сақтау
ru: Сохранить изменения

# cancelButton
source: Cancel
kk: Болдырмау
ru: Отмена

# doneButton
source: Done
kk: Дайын
ru: Готово

# userPlaceholder
source: User
kk: Пайдаланушы
ru: Пользователь

# chooseOneGift
source: Choose one of the gifts
kk: Сыйлықтардың бірін таңдаңыз
ru: Выберите один из подарков

# activateButton
source: Activate
kk: Белсендіру
ru: Активировать

# saveGiftButton
source: Save
kk: Сақтау
ru: Сохранить

# readyButton
source: Done
kk: Дайын
ru: Готово

# myGiftsButton
source: My Gifts
kk: Менің сыйлықтарым
ru: Мои подарки

# activateGiftInstructions
source: Activate the gift only at the checkout and pick it up within 10 minutes. If you want to pick up the gift later, save it in the "My Gifts" section
kk: Сыйлықты тек кассада белсендіріп, оны 10 минут ішінде алыңыз. Сыйлықты кейінірек алғыңыз келсе, оны «Менің сыйлықтарым» бөлімінде сақтаңыз
ru: Активируйте подарок только у кассы и заберите его в течение 10 минут. Если вы хотите забрать подарок позже, сохраните его в разделе «Мои подарки»

# timeNow
source: Now
kk: Қазір
ru: Сейчас

# timeMinutesAgo
source: {count, plural, one{1 minute ago} other{{count} minutes ago}}
kk: {count, plural, one{1 минут бұрын} other{{count} минут бұрын}}
ru: {count, plural, one{минуту назад} few{минуты назад} other{минут назад}}

# timeHoursAgo
source: {count, plural, one{1 hour ago} other{{count} hours ago}}
kk: {count, plural, one{1 сағат бұрын} other{{count} сағат бұрын}}
ru: {count, plural, one{час назад} few{часа назад} other{часов назад}}

# timeYesterday
source: Yesterday
kk: Кеше
ru: Вчера

# timeWeeksAgo
source: {count, plural, one{1 week ago} other{{count} weeks ago}}
kk: {count, plural, one{1 апта бұрын} other{{count} апта бұрын}}
ru: {count, plural, one{неделю назад} few{недели назад} other{недель назад}}

# timeMonthsAgo
source: {count, plural, one{1 month ago} other{{count} months ago}}
kk: {count, plural, one{1 ай бұрын} other{{count} ай бұрын}}
ru: {count, plural, one{месяц назад} few{месяца назад} other{месяцев назад}}

# timeYearsAgo
source: {count, plural, one{1 year ago} other{{count} years ago}}
kk: {count, plural, one{1 жыл бұрын} other{{count} жыл бұрын}}
ru: {count, plural, one{год назад} few{года назад} other{лет назад}}

# weekdayMonday
source: Monday
kk: Дүйсенбі
ru: Понедельник

# weekdayTuesday
source: Tuesday
kk: Сейсенбі
ru: Вторник

# weekdayWednesday
source: Wednesday
kk: Сәрсенбі
ru: Среду

# weekdayThursday
source: Thursday
kk: Төрт күні
ru: Четверг

# weekdayFriday
source: Friday
kk: Пятница
ru: Пятницу

# weekdaySaturday
source: Saturday
kk: Сенбі
ru: Субботу

# weekdaySunday
source: Sunday
kk: Жексенбі
ru: Воскресенье

# sending
source: Sending code
kk: Кодты жіберу
ru: Отправка кода

# agreementStart
source: By clicking "REGISTER", you agree to our
kk: "ТІРКЕЛУ" басып, сіз келісесіз
ru: Нажав "ЗАРЕГИСТРИРОВАТЬСЯ", вы соглашаетесь c

source: Terms of Use
kk: Пайдалану шарттарымен
ru: Условиями использования

source: and
kk: және
ru: и

source: Privacy Policy
kk: Құпиялылық саясатына
ru: Политикой конфиденциальности

# haveAccount
source: Already have an account?
kk: Үже тіркелгіңіз бар ма?
ru: Уже есть аккаунт?

# accountFound
source: Account found! Enter code to login.
kk: Тіркелгі табылды! Кірмек үшін кодты енгізіңіз.
ru: Аккаунт найден! Введите код для входа.

source: Enter code
kk: Кодты енгізіңіз
ru: Введите код

# smsSent
source: We sent an SMS with an activation code to your phone number
kk: Біз сіздің телефон нөміріңізге активтеу кодын SMS-ке жіберді
ru: Мы отправили SMS с кодом активации на ваш номер телефона

# proceed
source: Continue
kk: Жалғастыру
ru: Продолжить

source: Wrong code
kk: Қате код
ru: Неверный код

# through
source: in
kk: ішінде
ru: через

# userNotFound
source: User not found. Please register.
kk: Пайдаланушы табылмады. Өтінемін, тіркеліңіз.
ru: Пользователь не найден. Пожалуйста, зарегистрируйтесь.

source: Almost done
kk: Дәл қазір
ru: Еще немного

# provideDataHint
source: Please provide your actual data so we can pick the perfect style for you.
kk: Өтінемін, сіз үшін ең жақсы стильді таңдау үшін ақтуал деректеріңіз берініз.
ru: Пожалуйста, предоставьте актуальные данные, чтобы мы подобрали для вас идеальный стиль.

# scanGiftAtCheckout
source: Scan QR code at the checkout
kk: Кассада QR-кодты сканерлеңіз
ru: Отсканируйте QR-код у кассы

# qrCodeAtCheckout
source: QR code is at the checkout
kk: QR-код кассада орналасқан
ru: QR-код находится у кассы

# scanQrAtStore
source: Scan QR code at the store
kk: Дүкенде QR-кодты сканерлеңіз
ru: Отсканируйте QR-код в магазине

# qrCodeForGift
source: QR code to receive a gift
kk: Сыйлық алу үшін QR-код
ru: QR-код для получения подарка

# qrCodeScannedSuccess
source: QR code scanned successfully!
kk: QR-код сәтті сканерленді!
ru: QR-код успешно отсканирован!

# pointCameraAtQr
source: Point the camera at the QR code
kk: Камераны QR-кодқа көрсетіңіз
ru: Наведите камеру на QR-код

# qrCodeInStore
source: QR code at KETROY store
kk: KETROY дүкенінде QR-код
ru: QR-код в магазине KETROY

# qrCodeEmpty
source: QR code is empty or damaged
kk: QR-код бос немесе бүлінген

# invalidQrCode
source: Invalid QR code. Use QR code from KETROY store
kk: Қате QR-код. KETROY дүкенінен QR-кодты пайдаланыңыз

# giftReceivedSuccess
source: Gift received successfully! 🎁
kk: Сыйлық сәтті алынды! 🎁
ru: Подарок успешно получен! 🎁

# giftDataError
source: Gift data error. Try again.
kk: Сыйлық деректері қатесі. Қайтадан көңіл бөліңіз.
ru: Ошибка данных подарка. Попробуйте ещё раз.

# giftActivationError
source: Error activating gifts
kk: Сыйлықтарды белсендіру қатесі
ru: Ошибка при активации подарков

source: Activating gift
kk: Сыйлықты белсендіру
ru: Активация подарка

source: Checking gifts...
kk: Сыйлықтарды тексеру...
ru: Проверяем подарки...

# flashOff
source: Off
kk: Өшіру
ru: Выкл

# flashOn
source: Flash
kk: Флэш
ru: Вспышка

# giftConfirmationError
source: Confirmation error
kk: Растау қатесі
ru: Ошибка подтверждения

# giftConfirmationFailed
source: Error confirming gift issue
kk: Сыйлық өндіктеуді растау қатесі
ru: Ошибка при подтверждении выдачи

source: No internet connection
kk: Интернет байланысы жоқ
ru: Нет подключения к интернету

# giftNotFound
source: Gift not found in catalog or was deleted
kk: Сыйлық каталогында табылмады немесе өшірілді
ru: Подарок не найден в каталоге, либо был удален

# giftNotYours
source: Gift does not belong to you
kk: Сыйлық сізге қарамайды
ru: Подарок не принадлежит вам

# giftAlreadyIssued
source: Gift has already been issued or is not ready for issue
kk: Сыйлық әлдеқашан берілген немесе өндіктеуге дайын емес
ru: Подарок уже был выдан или не готов к выдаче

# showEmployeeMessage
source: Show this message to an employee
kk: Бұл хабарламаны қызметкерге көрсетіңіз
ru: Покажите это сообщение сотруднику

# excellent
source: Great!
kk: Керемет!
ru: Отлично!

source: Receiving gift
kk: Сыйлықты қабылдау
ru: Получение подарка

source: Your gift:
kk: Сіздің сыйлығыңыз:
ru: Ваш подарок:

source: Confirming issue...
kk: Өндіктеуді растау...
ru: Подтверждаем выдачу...

# selectGiftInstruction
source: Click on any gift to see what's inside!
kk: Кез келген сыйлықты басыңыз, ішінде не болғанын білу үшін!
ru: Нажмите на любой подарок, чтобы узнать что внутри!

# photographClothingLabel
source: Photograph the clothing label
kk: Киім бәлінің суретін түсіңіз
ru: Сфотографируйте ярлык одежды

# washingSymbols
source: Washing, ironing and drying symbols
kk: Жуу, есіктеу және кептіру белгілері
ru: Символы стирки, глажки и сушки

source: Analyzing label...
kk: Бәлі талдау...
ru: Анализирую этикетку...

# aiProcessingImage
source: AI is processing the image
kk: AI суретті өңдейді
ru: AI обрабатывает изображение

source: Analyze this label
kk: Бұл бәлі талдаңыз
ru: Проанализируй эту этикетку
