Repository: pernebye/Ketroy
Catalog: ketroy-flutter-dev/lib/l10n/app_*.arb
Languages: kk, ru

source: Profile
kk: Парақша
ru: Профиль

source: Account
kk: Тіркелгі
ru: Аккаунт

source: Bonuses
kk: Бонустар
ru: Бонусы

source: User
kk: Қолданушы
ru: Пользователь

source: Welcome
kk: Қош келдіңіз
ru: Добро пожаловать

# loginForFullAccess
source: Log in for full access to all features
kk: Барлық функцияларға қол жеткізу үшін кіріңіз
ru: Войдите для доступа ко всем функциям

source: Profile Settings
kk: Парақша параметрлері
ru: Настройки профиля

# shops
source: Stores
kk: Дүкендер
ru: Магазины

source: My Gifts
kk: Менің сыйлықтарым
ru: Мои подарки

source: Bonus Program
kk: Бонус бағдарламасы
ru: Бонусная программа

# shareDiscount
source: Share Discount with Friend
kk: Досыңа жеңілдік сыйла
ru: Подари скидку другу

source: Notification Settings
kk: Хабарландыру параметрлері
ru: Настройки уведомлений

source: Settings
kk: Параметрлер
ru: Настройки

source: Language
kk: Тіл
ru: Язык

source: Language Settings
kk: Тіл параметрлері
ru: Настройки языка

source: System Language
kk: Жүйелік тіл
ru: Системный язык

source: Select Language
kk: Тілді таңдаңыз
ru: Выберите язык

source: Notifications
kk: Хабарландырулар
ru: Уведомления

source: Push Notifications
kk: Push-хабарландырулар
ru: Push-уведомления

source: Manage push notifications
kk: Push-хабарландыруларды басқару
ru: Управление push-уведомлениями

source: All Notifications
kk: Барлық хабарландырулар
ru: Все уведомления

source: Enabled
kk: Қосылған
ru: Включены

source: Disabled
kk: Өшірілген
ru: Выключены

source: Notification Categories
kk: Хабарландыру санаттары
ru: Категории уведомлений

# newsAndPromotions
source: News & Promotions
kk: Жаңалықтар мен акциялар
ru: Новости и акции

# newsDescription
source: New collections, discounts, events
kk: Жаңа коллекциялар, жеңілдіктер, оқиғалар
ru: Новые коллекции, скидки, события

source: Gifts
kk: Сыйлықтар
ru: Подарки

# giftsDescription
source: New gifts and promo codes
kk: Жаңа сыйлықтар мен промокодтар
ru: Новые подарки и промокоды

source: Discounts
kk: Жеңілдіктер
ru: Скидки

# discountsDescription
source: Personal discounts and offers
kk: Жеке жеңілдіктер мен ұсыныстар
ru: Персональные скидки и предложения

# bonusNotifications
source: Bonuses
kk: Бонустар
ru: Бонусы

# bonusDescription
source: Bonus accrual and redemption
kk: Бонустарды есептеу және шегеру
ru: Начисление и списание бонусов

# systemNotifications
source: System
kk: Жүйелік
ru: Системные

# systemDescription
source: Important app notifications
kk: Қолданбадан маңызды хабарландырулар
ru: Важные уведомления от приложения

# notificationSettingsHint
source: You can always change notification settings in your device's system settings
kk: Құрылғының жүйелік параметрлерінде хабарландыру параметрлерін әрқашан өзгерте аласыз
ru: Вы всегда можете изменить настройки уведомлений в системных настройках устройства

# authRequired
source: Authorization Required
kk: Авторизация қажет
ru: Требуется авторизация

# authRequiredMessage
source: To access information about yourself, discounts, gifts and other bonuses — you need to register!
kk: Өзіңіз, жеңілдіктер, сыйлықтар және басқа бонустар туралы ақпаратты білу үшін — тіркелу қажет!
ru: Чтобы узнать информацию о себе, скидках, подарках и других бонусах — необходимо пройти регистрацию!

# authRequiredQr
source: To scan QR code and receive bonuses, you need to log in.
kk: QR-кодты сканерлеу және бонустар алу үшін аккаунтқа кіру қажет.
ru: Для сканирования QR-кода и получения бонусов необходимо войти в аккаунт.

# authRequiredNotifications
source: To view notifications, you need to log in.
kk: Хабарландыруларды көру үшін аккаунтқа кіру қажет.
ru: Для просмотра уведомлений необходимо войти в аккаунт.

# loginToAccount
source: Log In
kk: Аккаунтқа кіру
ru: Войти в аккаунт

source: Cancel
kk: Болдырмау
ru: Отмена

# startUsing
source: How would you like to start using the app?
kk: Қолданбаны қолдануды неден бастағыңыз келеді?
ru: С чего хотите начать использование приложения?

source: Register
kk: Тіркелу
ru: Зарегистрироваться

source: Browse as Guest
kk: Қонақ ретінде қарау
ru: Ознакомиться как гость

source: Welcome Back!
kk: Қош келдіңіз!
ru: Добро пожаловать!

# joinPrivilegeClub
source: Join the Privilege Club
kk: Артықшылықтар клубына кіру
ru: Войти в клуб привилегий

source: Enter Private Club
kk: Жабық клубқа кіру
ru: Войти в закрытый клуб

# noAccount
source: Don't have an account?
kk: Аккаунтыңыз жоқ па?
ru: У вас нет аккаунта?

source: Sign Up
kk: Тіркелу
ru: Зарегистрироваться

source: Enter phone number
kk: Телефон нөмірін енгізіңіз
ru: Введите номер телефона

# phoneNumberTooShort
source: Phone number is too short
kk: Телефон нөмірі тым қысқа
ru: Номер телефона слишком короткий

# accountNotFound
source: Account not found. Please register.
kk: Аккаунт табылмады. Тіркеліңіз.
ru: Аккаунт не найден. Пожалуйста, зарегистрируйтесь.

# codeSendError
source: Code sending error
kk: Код жіберу қатесі
ru: Ошибка отправки кода

source: Unknown error
kk: Белгісіз қате
ru: Неизвестная ошибка

# dataLoadError
source: Data loading error
kk: Деректерді жүктеу қатесі
ru: Ошибка загрузки данных

source: Retry
kk: Қайталау
ru: Повторить

source: Showcase
kk: Көрме
ru: Витрина

# giftsTab
source: Gifts
kk: Сыйлықтар
ru: Подарки

# logoutFromAccount
source: Log Out
kk: Аккаунттан шығу
ru: Выйти с аккаунта

source: Delete Account
kk: Аккаунтты жою
ru: Удалить аккаунт

# logoutConfirm
source: Log out from account?
kk: Аккаунттан шығу керек пе?
ru: Выйти с аккаунта?

# deleteAccountConfirm
source: Delete account?
kk: Аккаунтты жою керек пе?
ru: Удалить аккаунт?

# deleteAccountWarning
source: By deleting your account, you lose access to all personal data, including bonuses and special offers. Re-registration will remain available at any time.
kk: Аккаунтты жою арқылы сіз бонустар мен арнайы ұсыныстарды қоса алғанда, барлық жеке деректерге қол жеткізуден айырыласыз. Қайта тіркелу кез келген уақытта қолжетімді болады.
ru: Удаляя аккаунт, вы теряете доступ ко всем персональным данным, включая бонусы и специальные предложения. Повторная регистрация останется доступной в любой момент.

source: Yes
kk: Иә
ru: Да

source: No
kk: Жоқ
ru: Нет

source: Delete
kk: Жою
ru: Удалить

source: Personal Data
kk: Жеке деректер
ru: Личные данные

source: Surname
kk: Тегі
ru: Фамилия

source: Name
kk: Аты
ru: Имя

# birthDate
source: Date of Birth
kk: Туған күні
ru: Дата рождения

source: Select date
kk: Күнді таңдаңыз
ru: Выберите дату

source: City
kk: Қала
ru: Город

source: Select city
kk: Қаланы таңдаңыз
ru: Выберите город

source: Sizes
kk: Өлшемдер
ru: Размеры

source: Height
kk: Бойы
ru: Рост

source: Clothing Size
kk: Киім өлшемі
ru: Размер одежды

source: Shoe Size
kk: Аяқ киім өлшемі
ru: Размер обуви

source: Save Changes
kk: Өзгерістерді сақтау
ru: Сохранить изменения

source: Done
kk: Дайын
ru: Готово

source: All Cities
kk: Барлық қалалар
ru: Все города

source: KETROY Store Network
kk: KETROY дүкендер желісі
ru: Сеть магазинов KETROY

source: More Details
kk: Толығырақ
ru: Подробнее

# noShopsFound
source: No stores found
kk: Дүкендер табылмады
ru: Магазинов не найдено

# noShopsInCity
source: There are no KETROY stores in the selected city yet
kk: Таңдалған қалада әзірше KETROY дүкендері жоқ
ru: В выбранном городе пока нет магазинов KETROY

source: Your saved gifts
kk: Сіздің сақталған сыйлықтарыңыз
ru: Ваши сохранённые подарки

# noGiftsYet
source: You don't have any gifts yet
kk: Сізде әзірше сыйлықтар жоқ
ru: У вас пока нет подарков

# saveGiftsHint
source: Save gifts from the showcase to activate them in store
kk: Дүкенде белсендіру үшін көрмеден сыйлықтарды сақтаңыз
ru: Сохраняйте подарки из витрины, чтобы активировать их в магазине

source: Gift Activated!
kk: Сыйлық белсендірілді!
ru: Подарок активирован!

# dontCloseWindow
source: Don't close this window until you receive your gift in the store.
kk: Дүкенде сыйлық алғанша терезені жаппаңыз.
ru: Не закрывайте окно, пока не получите подарок в магазине.

source: Activated Gift
kk: Белсендірілген сыйлық
ru: Активированный подарок

source: Earn and Save
kk: Жинап үнемдеңіз
ru: Накапливайте и экономьте

# newItems
source: NEW
kk: ЖАҢАЛЫҚТАР
ru: НОВИНКИ

# bonusProgramTitle
source: Bonus Program
kk: Бонус бағдарламасы
ru: Бонусная программа

# earnBonusesWithPurchase
source: Earn bonuses with every purchase
kk: Әр сатып алудан бонустар жинаңыз
ru: Накапливайте бонусы с каждой покупкой

# upTo
source: Up to 10%
kk: 10%-ға дейін
ru: До 10%

source: Cashback
kk: Кэшбэк
ru: Кэшбэк

source: For purchases
kk: Сатып алу үшін
ru: За покупки

source: Status
kk: Мәртебе
ru: Статус

source: January
kk: Қаңтар
ru: Январь

source: February
kk: Ақпан
ru: Февраль

source: March
kk: Наурыз
ru: Март

source: April
kk: Сәуір
ru: Апрель

source: May
kk: Мамыр
ru: Май

source: June
kk: Маусым
ru: Июнь

source: July
kk: Шілде
ru: Июль

source: August
kk: Тамыз
ru: Август

source: September
kk: Қыркүйек
ru: Сентябрь

source: October
kk: Қазан
ru: Октябрь

source: November
kk: Қараша
ru: Ноябрь

source: December
kk: Желтоқсан
ru: Декабрь

source: Write Review
kk: Пікір жазу
ru: Написать отзыв

# shareYourExperience
source: Share your experience about the store
kk: Дүкен туралы әсеріңізбен бөлісіңіз
ru: Поделитесь впечатлениями о магазине

# selectShop
source: Select Store
kk: Дүкенді таңдаңыз
ru: Выберите магазин

# rateShop
source: Rate the Store
kk: Дүкенді бағалаңыз
ru: Оцените магазин

# tapStarsToRate
source: Tap the stars to rate
kk: Бағалау үшін жұлдыздарды басыңыз
ru: Нажмите на звёзды для оценки

# ratingVeryBad
source: Very bad 😞
kk: Өте нашар 😞
ru: Очень плохо 😞

# ratingBad
source: Bad 😕
kk: Нашар 😕
ru: Плохо 😕

# ratingNormal
source: Normal 😐
kk: Қалыпты 😐
ru: Нормально 😐

# ratingGood
source: Good 😊
kk: Жақсы 😊
ru: Хорошо 😊

# ratingExcellent
source: Excellent! 🤩
kk: Керемет! 🤩
ru: Отлично! 🤩

# reviewHint
source: Tell us about your store visit experience...
kk: Дүкенге бару тәжірибеңіз туралы айтыңыз...
ru: Расскажите о вашем опыте посещения магазина...

source: Send Review
kk: Пікірді жіберу
ru: Отправить отзыв

# reviewSentSuccess
source: Review sent successfully!
kk: Пікір сәтті жіберілді!
ru: Отзыв успешно отправлен!

# reviewSentError
source: Error sending review
kk: Пікірді жіберу қатесі
ru: Ошибка отправки отзыва

source: discount
kk: жеңілдік
ru: скидка

source: Scan QR
kk: QR сканерле
ru: Сканируй QR

# tg
source: KZT
kk: ТГ
ru: ТГ

source: Required field
kk: Міндетті өріс
ru: Обязательное поле

source: Server error
kk: Сервер қатесі
ru: Ошибка сервера

# tokenExpired
source: Token expired. Please log in again.
kk: Токен мерзімі өтті. Қайта кіріңіз.
ru: Токен истёк. Необходимо войти заново.

source: Menu
kk: Мәзір
ru: Меню

source: Main Menu
kk: Басты мәзір
ru: Главное меню

source: For Partners
kk: Серіктестерге
ru: Для партнёров

# weInSocials
source: Social Media
kk: Біз әлеуметтік желілерде
ru: Мы в соцсетях

# appInitError
source: App initialization error
kk: Қолданбаны инициализациялау қатесі
ru: Ошибка инициализации приложения

source: Close App
kk: Қолданбаны жабу
ru: Закрыть приложение

source: Expired
kk: Мерзімі өтті
ru: Истёк

source: Critical
kk: Сыни
ru: Критично

source: Expiring soon
kk: Жуырда аяқталады
ru: Скоро истечёт

source: Active
kk: Белсенді
ru: Активен

source: Active Gifts
kk: Белсенді сыйлықтар
ru: Активные подарки

source: Saved Gifts
kk: Сақталған сыйлықтар
ru: Сохраненные подарки

# noSavedGifts
source: You have no saved gifts
kk: Сізде сақталған сыйлықтар жоқ
ru: У вас нет сохраненных подарков

# giftsWillAppear
source: Gifts will appear here after receiving
kk: Сыйлықтар алғаннан кейін осында пайда болады
ru: Подарки появятся здесь после получения

source: No active gifts
kk: Белсенді сыйлықтар жоқ
ru: Нет активных подарков

# activateGiftToSee
source: Activate a gift to see it here
kk: Оны көру үшін сыйлықты белсендіріңіз
ru: Активируйте подарок, чтобы увидеть его здесь

source: Updating...
kk: Жаңартылуда...
ru: Обновляется...

source: Update
kk: Жаңарту
ru: Обновить

source: Update error
kk: Жаңарту қатесі
ru: Ошибка обновления

# youActivatedGift
source: You activated a gift
kk: Сыйлықты белсендірдіңіз
ru: Вы активировали подарок

# giftIsNearby
source: The gift is near! Don't close this window until you receive it.
kk: Сыйлық жақын! Оны алғанша терезені жаппаңыз.
ru: Подарок уже рядом! Не закрывайте окно, пока не получите его.

# activatedGiftNumber
source: Activated gift #{id}
kk: Белсендірілген сыйлық #{id}
ru: Активированный подарок #{id}

source: Congratulations!
kk: Құттықтаймыз!
ru: Поздравляем!

# giftActivatedLabel
source: Gift activated
kk: Сыйлық белсендірілді
ru: Подарок активирован

source: Activate
kk: Белсендіру
ru: Активировать

# activateGiftQuestion
source: Activate gift?
kk: Сыйлықты белсендіру керек пе?
ru: Активировать подарок?

# activateGiftWarning
source: Activate the gift only at the checkout and pick it up within 10 minutes. If you want to pick up the gift later, save it in the "My Gifts" section
kk: Сыйлықты тек кассада белсендіріп, оны 10 минут ішінде алыңыз. Сыйлықты кейінірек алғыңыз келсе, оны «Менің сыйлықтарым» бөлімінде сақтаңыз
ru: Активируйте подарок только у кассы и заберите его в течение 10 минут. Если вы хотите забрать подарок позже, сохраните его в разделе «Мои подарки»

source: Back
kk: Артқа
ru: Назад

source: Virtual Assistant
kk: Виртуалды көмекші
ru: Виртуальный помощник

# aiGreeting
source: Hi! 👋 I'm KETROY AI — your personal clothing care assistant.
kk: Сәлем! 👋 Мен KETROY AI — киім күтіміндегі жеке көмекшіңіз.
ru: Привет! 👋 Я KETROY AI — ваш персональный помощник по уходу за одеждой.

# aiInstructions
source: Take a photo of the clothing label — and I'll decode all the symbols and give recommendations for washing, drying, and ironing! 📸
kk: Киім этикеткасын суретке түсіріңіз — мен барлық белгілерді шешіп, жуу, кептіру және үтіктеу бойынша ұсыныстар беремін! 📸
ru: Сфотографируйте этикетку с одежды — и я расшифрую все символы и дам рекомендации по стирке, сушке и глажке! 📸

source: Analysis result
kk: Талдау нәтижесі
ru: Результат анализа

source: Analyzing...
kk: Талдау...
ru: Анализирую...

# typeMessage
source: Type a message...
kk: Хабарлама жазыңыз...
ru: Напишите сообщение...

source: Take Photo
kk: Суретке түсіру
ru: Сделать фото

source: Choose from Gallery
kk: Галереядан таңдау
ru: Выбрать из галереи

# pointCameraAtLabel
source: Point the camera at the clothing label
kk: Камераны киім бәліне көрсетіңіз
ru: Наведите камеру на этикетку одежды

source: Processing...
kk: Өңдеу...
ru: Обработка...

source: Scan label
kk: Этикетканы сканерлеу
ru: Сканировать этикетку

# photoError
source: Error taking photo
kk: Фото түсіру қатесі
ru: Ошибка при съемке фото

# errorOccurred
source: An error occurred
kk: Қате орын алды
ru: Произошла ошибка

# aiAuthRequired
source: To use the AI assistant, you need to log in!
kk: AI көмекшісін пайдалану үшін аккаунтқа кіру қажет!
ru: Для использования AI помощника необходимо войти в аккаунт!

source: Send code again
kk: Кодты қайта жіберу
ru: Отправить код повторно

# photoLoadError
source: Error loading photo
kk: Фотоны жүктеу қатесі
ru: Ошибка при загрузке фото

# imageSentForAnalysis
source: Image successfully sent for analysis!
kk: Сурет талдауға сәтті жіберілді!
ru: Изображение успешно отправлено на анализ!

# sendError
source: An error occurred while sending
kk: Жіберу кезінде қате орын алды
ru: Произошла ошибка при отправке

source: Retake
kk: Қайта түсіру
ru: Переснять

source: Send
kk: Жіберу
ru: Отправить

# photoPreview
source: Preview
kk: Алдын ала қарау

source: Error
kk: Қате
ru: Ошибка

# allNotificationsMarkedRead
source: All notifications marked as read
kk: Барлық хабарландырулар оқылды деп белгіленді
ru: Все уведомления отмечены как прочитанные

source: Your promo code
kk: Сіздің промокодыңыз
ru: Ваш промокод

source: Share and get bonuses
kk: Бөлісіп бонустар алыңыз
ru: Поделитесь и получайте бонусы

source: Promo code copied
kk: Промокод көшірілді
ru: Промокод скопирован

# sharePromoDescription
source: Share the promo code with a friend and get 2% from their first three purchases.
kk: Досыңызбен промокодпен бөлісіп, оның алғашқы үш сатып алуынан 2% алыңыз.
ru: Поделитесь промокодом с другом и получайте 2% с его первых трёх покупок.

source: Share
kk: Бөлісу
ru: Поделиться

# friendPromocode
source: Friend's promo code
kk: Достың промокоды
ru: Промокод друга

# enterAndGetDiscount
source: Enter and get 10% discount
kk: Енгізіп 10% жеңілдік алыңыз
ru: Введите и получите скидку 10%

# enterFriendPromocode
source: Enter friend's promo code
kk: Достың промокодын енгізіңіз
ru: Введите промокод друга

# friendPromoDescription
source: Get a personal 10% discount and participate in the rewards program.
kk: 10% жеке жеңілдік алып, жинақ бағдарламасына қатысыңыз.
ru: Получите персональную скидку 10% и участвуйте в программе накопления.

source: Apply
kk: Қолдану
ru: Применить

source: Promo code applied!
kk: Промокод қолданылды!
ru: Промокод применён!

# promocodeAppliedDescription
source: You now have a personal 10% discount on purchases at KETROY stores.
kk: Енді сізде KETROY дүкендерінде 10% жеке жеңілдік бар.
ru: Теперь у вас персональная скидка 10% на покупки в магазинах KETROY.

source: Great
kk: Тамаша
ru: Отлично

source: Promo code not found
kk: Промокод табылмады
ru: Промокод не найден

# promocodeNotFoundDescription
source: Check the entry or ask your friend to send the promo code again.
kk: Енгізуді тексеріңіз немесе досыңыздан промокодты қайта жіберуін сұраңыз.
ru: Проверьте правильность ввода или попросите друга отправить промокод ещё раз.

source: Enter again
kk: Қайта енгізу
ru: Ввести заново

source: Give discount
kk: Жеңілдік сыйла
ru: Подари скидку

source: Share with friends
kk: Достарыңызбен бөлісіңіз
ru: Поделитесь с друзьями

# joinKetroy
source: 🎁 Join Ketroy Shop! Get {discount}% discount when registering with this link: {link} 📱 Download the app and start saving!
kk: 🎁 Ketroy Shop-қа қосылыңыз! Осы сілтеме арқылы тіркелгенде 20% жеңілдік алыңыз: {link} 📱 Қолданбаны жүктеп, үнемдей бастаңыз!
ru: 🎁 Присоединяйтесь к Ketroy Shop! Получите скидку в 20% при регистрации по этой ссылке: {link} 📱 Скачайте приложение и начните экономить!

# ketroyInvitation
source: Ketroy Shop Invitation
kk: Ketroy Shop шақыруы
ru: Приглашение в Ketroy Shop

# systemLanguageHint
source: Select "System Language" to automatically use your device's language
kk: Құрылғы тілін автоматты түрде анықтау үшін "Жүйелік тіл" таңдаңыз
ru: Выберите "Системный язык" для автоматического определения языка устройства

# pendingGiftsTitle
source: {count, plural, =1{You have {count} gift waiting for selection!} other{You have {count} gifts waiting for selection!}}
kk: {count, plural, =1{Сізде {count} сыйлық таңдауды күтуде!} other{Сізде {count} сыйлық таңдауды күтуде!}}
ru: {count, plural, =1{У вас {count} подарок ожидает выбора!} few{У вас {count} подарка ожидают выбора!} many{У вас {count} подарков ожидают выбора!} other{У вас {count} подарка ожидают выбора!}}

# pendingGiftsSubtitle
source: Pick up your gift at the store
kk: Сыйлығыңызды дүкеннен алыңыз
ru: Заберите подарок в магазине

# scanQrToGetGift
source: Scan QR to receive
kk: Алу үшін QR сканерлеу
ru: Сканировать QR для получения

# usAlready
source: We already have
kk: Бізді қазірдің өзінде
ru: Нас уже

source: users
kk: пайдаланушылар
ru: пользователей

source: Contact us
kk: Бізбен байланысыңыз
ru: Свяжитесь с нами

# partnershipDescription
source: If you have any suggestions for cooperation, partnership or questions about advertising in our mobile app — write to us on WhatsApp!
kk: Егер сізде ынтымақтастық, серіктестік туралы ұсыныстарыңыз немесе мобильді қосымшадағы жарнама туралы сұрақтарыңыз болса — бізге WhatsApp-қа жазыңыз!
ru: Если у вас есть предложения о сотрудничестве, партнёрстве или вопросы о рекламе в нашем мобильном приложении — напишите нам в WhatsApp!

source: Write to WhatsApp
kk: WhatsApp-қа жазу
ru: Написать в WhatsApp

# partnershipBenefits
source: What we offer
kk: Біз не ұсынамыз
ru: Что мы предлагаем

# benefitAds
source: Advertising in mobile app
kk: Мобильді қосымшадағы жарнама
ru: Рекламу в мобильном приложении

# benefitPromo
source: Joint promotions and giveaways
kk: Бірлескен акциялар мен ұтыстар
ru: Совместные акции и розыгрыши

# benefitBusiness
source: B2B cooperation
kk: B2B ынтымақтастық
ru: B2B сотрудничество

source: Current promotions
kk: Қолданыстағы акциялар
ru: Действующие акции

source: No active promotions
kk: Белсенді акциялар жоқ
ru: Нет активных акций

source: Check back later
kk: Кейін тексеріңіз
ru: Загляните позже

source: News
kk: Жаңалықтар
ru: Новости

source: All
kk: Барлығы
ru: Все

source: Read more
kk: Толығырақ
ru: Подробнее

source: No news found
kk: Жаңалықтар табылмады
ru: Новости не найдены

# viewedAllNews
source: You've viewed all news
kk: Сіз барлық жаңалықтарды көрдіңіз
ru: Вы просмотрели все новости

# loadingNews
source: Loading...
kk: Жүктелуде...
ru: Загрузка...

# loadError
source: Loading error
kk: Жүктеу қатесі
ru: Ошибка загрузки

# refreshError
source: Error refreshing data
kk: Деректерді жаңарту қатесі
ru: Ошибка обновления данных

# notificationsTitle
source: Notifications
kk: Хабарландырулар
ru: Уведомления

# filterUnread
source: Unread
kk: Оқылмаған
ru: Не прочитано

# filterDebit
source: Debit
kk: Шегеру
ru: Списание

# filterGifts
source: Gifts
kk: Сыйлықтар
ru: Подарки

# filterDiscounts
source: Discounts
kk: Жеңілдіктер
ru: Скидки

# filterNews
source: News
kk: Жаңалықтар
ru: Новости

# filterSystem
source: System
kk: Жүйелік
ru: Системные

source: No unread notifications
kk: Оқылмаған хабарландырулар жоқ
ru: Нет непрочитанных уведомлений

source: No debit notifications
kk: Шегеру туралы хабарландырулар жоқ
ru: Нет уведомлений о списаниях

source: No gift notifications
kk: Сыйлықтар туралы хабарландырулар жоқ
ru: Нет уведомлений о подарках

source: No discount notifications
kk: Жеңілдіктер туралы хабарландырулар жоқ
ru: Нет уведомлений о скидках

# noNewsNotifications
source: No news
kk: Жаңалықтар жоқ
ru: Нет новостей

source: No system notifications
kk: Жүйелік хабарландырулар жоқ
ru: Нет системных уведомлений

source: Mark all as read
kk: Барлығын оқылды деп белгілеу
ru: Прочитать все

# giftStatusPending
source: Pending selection
kk: Таңдауды күтуде
ru: Ожидает выбора

# giftStatusSelected
source: Selected
kk: Таңдалған
ru: Выбран

# giftStatusActivated
source: Activated
kk: Белсендірілген
ru: Активирован

# giftStatusIssued
source: Issued
kk: Берілген
ru: Выдан

# giftStatusReceived
source: Received
kk: Алынған
ru: Получен

source: Get at store
kk: Дүкеннен алу
ru: Получить в магазине

# selectGiftNow
source: Select your gift now!
kk: Сыйлығыңызды қазір таңдаңыз!
ru: Выберите свой подарок прямо сейчас!

source: Gift {number}
kk: Сыйлық {number}
ru: Подарок {number}

# variantsCount
source: {count} variants
kk: {count} нұсқа
ru: {count} вариантов

# selectButton
source: Select
kk: Таңдау
ru: Выбрать

source: Loading gifts...
kk: Сыйлықтар жүктелуде...
ru: Загрузка подарков...

source: Failed to load
kk: Жүктелмеді
ru: Не удалось загрузить

# checkInternet
source: Check your internet connection
kk: Интернет қосылымын тексеріңіз
ru: Проверьте подключение к интернету

# newGiftBanner
source: New gift!
kk: Жаңа сыйлық!
ru: Новый подарок!

source: List updated
kk: Тізім жаңартылды
ru: Список обновлён

# profileSettingsTitle
source: Profile Settings
kk: Профиль параметрлері
ru: Настройки профиля

# sectionPersonalData
source: Personal Data
kk: Жеке деректер
ru: Личные данные

# sectionSizes
source: Sizes
kk: Өлшемдер
ru: Размеры

# fieldSurname
source: Surname
kk: Тегі
ru: Фамилия

# fieldName
source: Name
kk: Аты
ru: Имя

# fieldBirthDate
source: Date of Birth
kk: Туған күні
ru: Дата рождения

# fieldCity
source: City
kk: Қала
ru: Город

# fieldHeight
source: Height
kk: Бойы
ru: Рост
